
// Task 1

// შექმენით ორი ფაილი, პირველის სახელი იყოს calculator.js ხოლო მეორე index.js,
// პირველ ფაილში შექმენით ფუნქცია რომელიც იღებს ორ არგუმენტს და ერთ ოპერაციას,
// გამოიყენეთ შესაბამის ოპერატორი რომ დააბრუნოთ ფუნქციიდან შედეგი, დააექსპორტეთეს
// ფუნქცია და გადაიტენეთ index.js ფაილში გამოიყენეთ module.exports და require() ახსენით რისთვის გამოიყენება თითოეული

// Task 2

// იგივე ფაილში შექმენით ფუნქცია სახელად filter რომელსაც გადაეცემა ერთი მასივი და მეორე ფუნცია არგუმენტად,
// გადაუარეთ for ციკლით მასივს და ყველა მნიშვნელობაზე გამოიძახეთ ფუნქცია რომელიც არგუმენტად მიიღეთ,
// მაგ ფუნქციას კი გადაეცით რიგრიგობით მნიშვნელობები, თუ დაბრუნებული მნიშვნელობა იქნება True შეინახეთ
// ახალ მასივში და დააბრუნეთ ეგ მასივი, filter and calculator ფუნქცია გადაიტანეთ index.js ფაილში და ორივე გამოიძახეთ

// require არის ფუნქცია, რომელსაც გადაეცემა ერთი არგუმენტი სთრინგის სახით,
// იმ კონკრეტული ფაილის მისამართი, საიდანაც გვინდა წამოვიღოთ მოდული
const calc = require('./calculator.js');

console.log(calc.calculator(10, 20, "+"));
console.log(calc.filter([1,2,3,4,5], (num) => num % 2 === 0));