
// Task 1

// კომენტარების გამოყენებით ახსენით js-ში ფუნქციები რაში გამოიყენება და როგორ გამოგადგებათ

// ფუნქციები გვეხმარება შევქმნათ კოდის ბლოკი მორგებული სხვადასხვა სიტუაციებზე, გვაძლევს საშუალებას
//  ავარიდოთ თავი განმეორებად კოდს და ვაკონტროლოთ HTML თეგების თვისებები ჩვენს საიტზე

// Task 2

// შექმენით პარაგრაფი, რომლის საწყისი ტექსტი იქნება 0. მის ქვემოთ შექმენით ერთი
//  ღილაკი, რომლის ყოველ დაკლიკებაზე counter ცვლადს ერთი მოემატება და ეს
//  რიცხვი გახდება პარაგრაფის textcontent

const num = document.getElementById("number");
let counter = 0;

function clickCounter(){
    counter += 1;
    num.textContent = counter;
}